{
    "latest": "blog-1",
    "allPosts": [
        {
            "id": "blog-1",
            "title": "A Message From Minity",
            "author": "Minity",
            "type": "blog",
            "date": {
                "long": "Tuesday, November 3rd, 2020",
                "short": "11/3/2020"
            },
            "desc": "A message from the artist.",
            "content": [
                "Hello everyone, this is Minity. I drew all the absolutely amazing art that you see on this website, including the background. As for the logo, Leo and I kinda worked together on that. I also write most of the story. GloopBloop helped a lot with that, and Leo helped a little, basically saying whether something sucked or not.",
                "I would also like to mention someone who is not yet credited on the about page: my friend Fchar, who helped me design the characters. In the future, he may help me do some of the artwork. This would definitely increase the quality and consistency of the drawings, because to be completely honest, I rushed a lot of these first 7 panels so that we could release the site today.",
                "This brings me to my next thought: the release schedule. As of now, I have no plan. I would like to upload pages in batches, since not a lot generally happens on one page. I hope to get some pages done pretty soon, so stay tuned for that. Unfortunately, I will be pretty busy this week, so work may be slow. I'll keep at it, though!",
                "I think I will try to improve the art as we go forward. With this first batch, I eventually came up with a rhythm to making them, and simplifying them as I went. I should try and get help with stuff from Fchar so the lineart and stuff will be more consistent. One of the main things I changed was removing most of the shading on the characters. This was for two reasons: first, it definitely saves time. Second, it looks a little better in my opinion.",
                "Finally, this is just a reminder that if you have any problems with the website, let us know by either joining the Discord server and sending us a message, making an issue on the Github repository, or messaging us on Twitter. Links to our profiles are in the about page."
            ]
        },
        {
            "id": "website-mobile-1",
            "title": "Partial Mobile Support",
            "author": "LeOtOmAs",
            "type": "website",
            "date": {
                "long": "Sunday, November 1st, 2020",
                "short": "11/1/2020"
            },
            "desc": "News about mobile support, and whats been done so far",
            "content": [
                "Hey there. I would like to announce that mobile support is here! Kind of...",
                "I have been hard at work improving the website, and I have gotten some work done on supporting mobile users.",
                "There is still work to be done to make it even better, but for now, I will go over how to navigate the site on mobile, and some of the things you can expect to change and improve in the future",
                "First things first, the header. Its actually at the bottom. So it is more of a footer. If you are in portrait mode, it should show up all the time, but if you are in landscape mode, you should just see the Team Prism logo in the bottom left corner, which you can tap on to show the menu.",
                "The menu has most of the things from the desktop header, with the exception of the wide mode toggle. I chose to not include it as everything just looks better on mobile when it is not in a narrow mode.",
                "You have the Home, Story, About, and Theme button from the desktop header, which all do what you would expect them to do.",
                "Now the things that are going to be changed and improved upon.",
                "A lot of text is really small, and thats going to be fixed soon, but I have tried to make the more important text visible.",
                "I am considering adding an 'Immersive' mode on the story page so that you have easy access to the next and previous buttons while the image or video can still take up most of the screen, but if I do not do that, I will at the very least include a button to show the image or video in fullscreen and go back quickly for mobile users.",
                "Another thing that will change is font scaling, as currently it is can be quite big in landscape mode, while the same text is really small in portrait mode.",
                "Thanks for reading, and I hope you enjoy the new mobile features!"
            ]
        },
        {
            "id": "announcement-welcome",
            "title": "Welcome",
            "author": "LeOtOmAs",
            "type": "announcement",
            "date": {
                "long": "(Updated 10/31/2020) Friday, October 30th, 2020",
                "short": "(Updated 10/31/20) 10/30/20"
            },
            "desc": "Hey there. Welcome to this thing.",
            "content": [
                "Hey there. Welcome to this thing. This is a webcomic that myself and the other people listed <a onclick='aboutPage(true)' href='#about'>in the about page</a> have been working on.",
                "This web comic project started because we wanted to create a game or something, but every time we had an idea, it was either to big of a project that we didn't really want to work on it, or it was so boring or simple, because we thought we need something simple as a first project, that we would work on it for an afternoon and then give up.",
                "Heres hoping this project lasts longer than those projects.",
                "Anyways, I thought I would take the time to write this first post and explain a few things about the website and how it works so you will hopefully have the best experience possible.",
                "Before I go over the features though, I would like to mention that there is no good mobile support on the website yet (Sorry phone gang), but it is planned, and will be here soon! Another thing to keep in mind is that things are probably going to change a bit in the coming months in terms of layout and styling of the website, so this will probably be inaccurate at some point.",
                "<br>At the top of the page is what is called the header. On it are 5 buttons.",
                "The 'Home' button is what this main page is. It will have these posts, which will contain updates about the website, and news regarding the state of the comic.",
                "The 'Story' button will take you to the story page, which is where you will be able to read the comic.",
                "The 'About' button will take you to the about page which has currently has links to view the source code (thats right, its open source!) and to join our discord server, and it also has an option to enable notifications, and also lists the members of Team Prism, and their roles on the project. It also has some debug info that you don't need to worry about unless you are reporting a bug with the website (which you should totally do if you find one!).",
                "The 'Theme' button will allow you to switch between dark theme and light theme. If you hold control while you click it, it will reset to defaulting to your system dark theme preference if available, otherwise, it will default to dark theme.",
                "The 'Wide' button will switch between the narrow page style that gives off twitter vibes with the amount of wasted space, and the wider page style that takes up more of the page ideal for people on desktop. Or really large screens. Up to you.",
                "If you are using Google Chrome or the new Microsoft Edge (Might also work in Safari, but Firefox does not support this feature yet), you should see a + button in the URL bar which you can use to 'install' an application like version of the website. Doing so will allow you to access some parts of the website more quickly from shortcuts.",
                "<br>On the story page, there are a few buttons you can click on to navigate between pages.",
                "Index will bring you to the index page, which you can use to navigate pages somewhat quickly, rather than just using the previous and next buttons.",
                "Unread will bring you to (hopefully) the first unread page you have. The way it figures it out is kinda jank though, so you should keep track of it somewhere if you don't want to lose your spot!",
                "The previous and next buttons will navigate to the previous and next page in relation to the current page.",
                "The first page and last page buttons will bring you to the very first page and most recent page respectively.",
                "<br><br>Some info for more technical users. Feel free to look at the source code on github, and if you find any issues or want to add a feature or improve an existing one, you can make an issue or a pull request.",
                "Thanks for checking this out, and I hope you enjoy reading the comic. Once we actually release some pages."
            ]
        }
    ]
}